Repository: moreelremy/FISA_A3_GL_MOREEL_Remy
Catalog: EasySave/EasySave.Shared/Model/Languages/language.*.resx
Languages: ru

# View_ChangeLanguage
source: Change language
ru: Изменить язык

# View_CreateBackup
source: Create a backup
ru: Создать резервную копию

# View_EnterBackupName
source: Enter the backup name:
ru: Введите имя резервной копии :

# View_EnterNumber
source: Please enter a number :
ru: Пожалуйста, введите номер:

# View_EnterSourcePath
source: Enter the source path:
ru: Введите исходный путь :

# View_EnterTargetPath
source: Enter the target path:
ru: Введите целевой путь :

# View_ExitApp
source: Exit the application
ru: Выйти из приложения

# InputHelper_InputError
source: The entry cannot be empty. Please enter a valid value.
ru: Запись не может быть пустой. Пожалуйста, введите допустимое значение.

# Controller_InvalidChoice
source: Invalid choice!
ru: Неверный выбор!

# View_LanguageChoice
source: Choose a language (EN/FR/RU)
ru: Выберите язык (EN/FR/RU) :

# View_ListOfBackups
source: ║ List of saves ║
ru: Список резервных копий

# View_NoBackups
source: No backups found.
ru: Резервные копии не найдены.

# Controller_PressAnyKey
source: Press any key to continue...
ru: Нажмите любую клавишу, чтобы продолжить...

# InputHelper_ReturningToMenu
source: Returning to the main menu...
ru: Вернёмся в главное меню...

# View_SaveAddedMessage
source: Save {0} has been added
ru: Сохранение {0} добавлено.

# View_SelectBackupType
source: Select backup type
ru: Выберите тип резервной копии

# View_StartBackup
source: Start a save
ru: Начать сохранение

# View_ViewAllSaves
source: See Backups
ru: См. резервные копии

# ControllerView_ViewLogs
source: View logs
ru: Просмотр журналов

# View_SaveName
source: Name
ru: Имя

# View_SaveSource
source: Source
ru: Источник

# View_SaveTarget
source: Target
ru: Цель

# View_SaveType
source: Type
ru: Добрый

# View_FullSave
source: Full backup
ru: Полное резервное копирование

# View_DifferentialSave
source: Differential backup
ru: Дифференциальное резервное копирование

# Controller_ActualRepo
source: Current directory
ru: Текущий каталог

# Controller_MaxSaveLimitReached
source: Maximum save limit reached (5).
ru: Достигнут максимальный предел сохранения (5).

# View_EnterSaveNameToDelete
source: Enter the name of the save to delete:
ru: Введите имя удаляемого сохранения:

# View_SaveDeleted
source: Save deleted successfully.
ru: Сохранение успешно удалено.

# View_SaveNotFound
source: Save not found.
ru: Сохранение не найдено.

# View_ChooseSaveToDelete
source: Choose a save to delete:
ru: Выберите сохранение для удаления:

# View_EnterSaveNumber
source: Enter the number of the save to delete:
ru: Введите номер сохранения для удаления:

# View_DateChoice
source: For what date do you want to view the logs (dd-MM-yyyy) ? [Today]
ru: За какую дату вы хотите просмотреть журналы (dd-MM-yyyy)?

# View_NumberSave
source: Backup number
ru: Резервный номер

# Controller_ChoiceDeleteOrMenu
source: Do you want to return to the menu or delete a backup?
ru: Хотите вернуться в меню или удалить резервную копию?

# Controller_ChoiceMenu
source: Menu
ru: Меню

# Controller_ChoiceDelete
source: Delete a save
ru: Удалить резервную копию

# Controller_AskChoiceDelete
source: Which backup do you want to delete?
ru: Какую резервную копию вы хотите удалить?

# View_ChooseSaveToExecute
source: Choose a backup to run:
ru: Выберите резервную копию для запуска:

# View_EnterSaveIdsToExecute
source: Enter the identifiers of the backups to be executed (ex: 1-5):
ru: Введите идентификаторы резервных копий, которые необходимо выполнить (например: 1-5):

# View_ExecutionCompleted
source: The backup execution completed successfully.
ru: Резервное копирование завершено успешно.

# View_ExecutionFailed
source: Backup execution failed.
ru: Не удалось выполнить резервное копирование.

# View_InvalidSelection
source: Invalid selection. Please try again.
ru: Неверный выбор. Пожалуйста, попробуйте еще раз.

# Controller_SaveExecutionError
source: Error running backup '{0}'. Reason: {1}.
ru: Исходный каталог «{1}» резервной копии «{0}» не существует.

# Controller_DirectoryNotFoundError
source: The source directory '{1}' of backup '{0}' does not exist.
ru: Исходный каталог «{1}» резервной копии «{0}» не существует.

# WPF_Leave
source: Leave
ru: уйти

# WPF_Property
source: Group 1 property
ru: Объект группы 1

# WPF_SaveName
source: Backup name
ru: Имя резервной копии

# WPF_SaveSource
source: Source path
ru: Исходный путь

# WPF_SaveTarget
source: Target path
ru: Целевой путь

# WPF_Folder
source: File
ru: Файл

# WPF_Create
source: CREATE
ru: СОЗДАВАТЬ

# WPF_Number
source: Number
ru: Число

# WPF_SavePartial
source: Partial backup
ru: Частичное резервное копирование

# WPF_SaveGlobal
source: Global backup
ru: Глобальное резервное копирование

# WPF_Search
source: Search
ru: Поиск

# WPF_Delete
source: Delete
ru: Удалить

# WPF_FileNotFound
source: There are no Logs for this date:
ru: На эту дату нет журналов:

# WPF_EnterNameSave
source: Enter a backup name
ru: Введите резервное имя

# WPF_SelectSource
source: Select a source folder
ru: Выберите исходную папку

# WPF_SelectTarget
source: Select a destination folder
ru: Выберите папку назначения

# WPF_SelectedFile
source: Selected Folder
ru: Выбранная папка

# WPF_Error
source: Error
ru: Ошибка

# WPF_NameProblem
source: The backup name already exists.
ru: Резервное имя уже существует.

# WPF_SourceProblem
source: The source folder does not exist.
ru: Исходная папка не существует.

# WPF_TargetProblem
source: The destination folder does not exist.
ru: Папка назначения не существует.

# WPF_Success
source: Success
ru: Успех

# WPF_CreateSuccess
source: The backup was created successfully.
ru: Резервная копия успешно создана.

# WPF_Details
source: Backup Details
ru: Подробности резервного копирования

# WPF_FieldProblem
source: Please complete all fields.
ru: Пожалуйста, заполните все поля.

# WPF_FormatLog
source: The date format is invalid (example
ru: Неверный формат даты (пример

# WPF_Format
source: format
ru: формат

# WPF_CryptExtension
source: Extension to Encrypt
ru: Расширение для шифрования

# View_jsonFileExtension
source: Logs in json format
ru: Логи в формате json

# View_xmlFileExtension
source: Logs in XML format
ru: Журналы в формате XML

# View_logFileExtension
source: Log format
ru: Формат журнала

# WPF_TypeSave
source: Backup type
ru: Тип резервной копии

# WPF_Date
source: Date
ru: Дата

# WPF_Size
source: Size
ru: Размер

# WPF_TransferTime
source: Copy time
ru: Время копирования

# WPF_TypeProblem
source: Please select a backup type.
ru: Пожалуйста, выберите тип резервного копирования.

# WPF_ExtensionProblem
source: Please select a format.
ru: Пожалуйста, выберите формат.

# WPF_EnterDate
source: Enter a date: dd-MM-yyyy
ru: Введите дату: ДД-ММ-ГГГГ

# WPF_SaveDelete
source: Backup name or number
ru: Резервное имя или номер

# WPF_CodeSave
source: Name / Number / 1;3 / 1-3
ru: Имя / Номер / 1;3 / 1-3

# WPF_Extension
source: Extension to encrypt
ru: Расширение для шифрования

# WPF_SettingSoftware
source: Business software:
ru: Программное обеспечение :

# WPF_SettingApply
source: APPLY
ru: Настройки

# WPF_SettingTitle
source: Settings
ru: Настройки

# WPF_SoftwareExample
source: Calculator ; explorer ; ERP
ru: Калькулятор, Проводник, Планирование ресурсов

# Controller_SaveExecutionErrorProcessRunning
source: The business process is running. Operation canceled.
ru: Бизнес-процесс запущен. Операция отменена.

# WPF_SettingSaturationLimit
source: Limit before saturation (ko)
ru: предел до насыщения :
